/*
 * DESCRIPTION
 *
 * Three color (RED, GREEN, BLUE) led driver.
 * Necessary color selected by Led_SelectColor() function (2^3=8 colors)
 *
 */

#ifndef LED_H
#define LED_H

/****************************************************************************/
/***        Include files                                                 ***/
/****************************************************************************/

#include "Config.h"
#include "Colors.h"

/****************************************************************************/
/***        Macro Definitions                                             ***/
/****************************************************************************/

/****************************************************************************/
/***        Type Definitions                                              ***/
/****************************************************************************/

/****************************************************************************/
/***        Exported Functions                                            ***/
/****************************************************************************/

PUBLIC void vLed_init(void);// Инициализировать вывода

PUBLIC void vLed_off(void);// Полностью выключить светодиод
PUBLIC void vLed_on(void);// Полностью включить светодиод

PUBLIC void vLed_selectColor(Colors_e Color);// Выбрать цвет свечения

#endif
